rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteDisplay.c
/***************************************************************************
 *
 * DTC-1200 & STC-1200 Digital Transport Controllers for
 * Ampex MM-1200 Tape Machines
 *
 * Copyright (C) 2016-2020, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 ***************************************************************************
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***************************************************************************/

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/gates/GateMutex.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/UART.h>

#include <file.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <math.h>
#include <stdbool.h>

/* Graphiclib Header file */
#include <grlib/grlib.h>
#include "drivers/offscrmono.h"

/* PMX42 Board Header file */
#include "Board.h"
#include "STC1200.h"
#include "Utils.h"
#include "IPCServer.h"
#include "RAMPServer.h"
#include "RemoteTask.h"

/* Static Function Prototypes */
static void drawInfoScreen(void);
static void drawTrackAssign(void);
static void drawTimeScreen(void);
static void drawTimeTop(void);
static void drawTimeMiddle(void);
static void drawTimeEdit(void);
static void drawTimeBottom(void);
static void drawMenuTrackSetAll(void);
static void drawMenuSetTapeSpeed(void);
static void drawMenuSetStandbyAll(void);
static void drawMenuSetMasterMon(void);
static void drawMenuSetBlink7Seg(void);
static void drawMenuSetLongTime(void);

/* Helpers */
static void GrSetRect(tRectangle* rect,
                      int16_t XMin, int16_t YMin,
                      int16_t XMax, int16_t YMax);

static void GrInflateRect(tRectangle* rect,
                      int16_t XMin, int16_t YMin,
                      int16_t XMax, int16_t YMax);

/* External Global Data */
extern tContext g_context;
extern tFont *g_psFontWDseg7bold24pt;
extern tFont *g_psFontWDseg7bold20pt;
extern tFont *g_psFontWDseg7bold18pt;
extern tFont *g_psFontWDseg7bold16pt;
extern tFont *g_psFontWDseg7bold14pt;
extern tFont *g_psFontWDseg7bold12pt;
extern tFont *g_psFontWDseg7bold10pt;
extern tFont *g_psFontWMonospace10pt;

//*****************************************************************************
// Graphics Helpers
//*****************************************************************************

void GrSetRect(tRectangle* rect,
               int16_t XMin, int16_t YMin,
               int16_t XMax, int16_t YMax)
{
    rect->i16XMin = XMin;
    rect->i16YMin = YMin;
    rect->i16XMax = XMax;
    rect->i16YMax = YMax;
}

void GrInflateRect(tRectangle* rect,
               int16_t XMin, int16_t YMin,
               int16_t XMax, int16_t YMax)
{
    rect->i16XMin += XMin;
    rect->i16YMin += YMin;
    rect->i16XMax += XMax;
    rect->i16YMax += YMax;
}

//*****************************************************************************
// Clear the display screen
//*****************************************************************************

void ClearScreen()
{
    tRectangle rect = {0, 0, SCREEN_WIDTH - 1, SCREEN_HEIGHT - 1};
    GrContextForegroundSetTranslated(&g_context, 0);
    GrContextBackgroundSetTranslated(&g_context, 0);
    GrRectFill(&g_context, &rect);
}

//*****************************************************************************
// Display the current measurement screen data
//*****************************************************************************

void DrawScreen(uint32_t uScreenNum)
{
    ClearScreen();

    switch(uScreenNum)
    {
    case VIEW_TAPE_TIME:
        drawTimeScreen();
        break;

    case VIEW_TRACK_ASSIGN:
        drawTrackAssign();
        break;

    case VIEW_TRACK_SET_ALL:
        drawMenuTrackSetAll();
        break;

    case VIEW_SET_STANDBY_ALL:
        drawMenuSetStandbyAll();
        break;

    case VIEW_SET_MASTER_MON:
        drawMenuSetMasterMon();
        break;

    case VIEW_SET_TAPE_SPEED:
        drawMenuSetTapeSpeed();
        break;

    case VIEW_INFO:
        drawInfoScreen();
        break;

    case VIEW_SET_LONGTIME:
        drawMenuSetLongTime();
        break;

    case VIEW_SET_BLINK7SEG:
        drawMenuSetBlink7Seg();
        break;

    default:
        break;
   }

    GrFlush(&g_context);
}

//*****************************************************************************
//
//*****************************************************************************

void drawInfoScreen(void)
{
    char buf[64];
    int32_t x, y;
    int32_t len;
    //int32_t width;
    int32_t height;
    uint32_t spacing = 4;

    /* Set foreground pixel color on to 0x01 */
    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    /* Use fixed system font */
    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);

