rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteDisplay.c
    x = SCREEN_WIDTH/2;
    y = 10;

    /* Display firmware version */
    len = sprintf(buf, "STC-1200 v%d.%02d.%d",
                  FIRMWARE_VER, FIRMWARE_REV, FIRMWARE_BUILD);
    GrStringDrawCentered(&g_context, buf, len, x, y, false);

    /* Display the ref clock frequency */
    y += (height + spacing);
    len = sprintf(buf, "REF %.2f Hz", g_sys.ref_freq);
    GrStringDrawCentered(&g_context, buf, len, x, y, false);

    /* Display the IP address */
    y += (height + spacing);
    if (strlen(g_sys.ipAddr) == 0)
        len = sprintf(buf, "IP (no network)");
    else
        len = sprintf(buf, "IP %s", g_sys.ipAddr);
    GrStringDrawCentered(&g_context, buf, len, x, y, false);
}

//*****************************************************************************
// Display the home tape time/position screen. This is the main application
// screen that users see in normal operation mode.
//*****************************************************************************

void drawTimeScreen(void)
{
    /* Draw the top line showing current mode/speed */
    drawTimeTop();

    /* Draw the current tape position time in the middle */
    if (g_sys.remoteMode == REMOTE_MODE_EDIT)
        drawTimeEdit();
    else
        drawTimeMiddle();

    /* Draw bottom line with current locate point time */
    drawTimeBottom();
}


void drawTimeTop(void)
{
    char buf[64];
    char txt[8];
    int32_t x, y;
    int32_t len;
    int32_t width;

    /*
     * Draw the current transport mode text on top line
     */

    if (IsLocatorSearching())
    {
        len = sprintf(buf, "SEARCH");
    }
    else if (IsLocatorAutoLoop())
    {
        len = sprintf(buf, "LOOP");
    }
    else
    {
        switch(g_sys.transportMode & MODE_MASK)
        {
        case MODE_HALT:
            len = sprintf(buf, "HALT");
            break;

        case MODE_THREAD:
            len = sprintf(buf, "THREAD");
            break;

        case MODE_STOP:
            len = sprintf(buf, "STOP");
            break;

        case MODE_PLAY:
            if (g_sys.transportMode & M_RECORD)
                len = sprintf(buf, "PLAY+REC");
            else
                len = sprintf(buf, "PLAY");
            break;

        case MODE_FWD:
            if (g_sys.transportMode & M_LIBWIND)
                len = sprintf(buf, "FWD+LIB");
            else
                len = sprintf(buf, "FWD");
            break;

        case MODE_REW:
            if (g_sys.transportMode & M_LIBWIND)
                len = sprintf(buf, "REW+LIB");
            else
                len = sprintf(buf, "REW");
            break;

        default:
            break;
        }
    }

    x = 0;
    y = 2;

    /* Top line fixed system font */
    GrContextFontSet(&g_context, g_psFontFixed6x8);

    /* Mono */
    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);
    GrStringDraw(&g_context, buf, -1, x, y, 1);

    /* Draw current tape speed active */
    if (g_sys.varispeedMode)
    {
        if (g_sys.varispeedMode == VARI_SPEED_TONE)
        {
            GetToneText(txt);
            len = sprintf(buf, "INC %s", txt);
        }
        else
        {
#if 0
            float percent = 0.0f;

            if (g_sys.ref_freq)
            {
                percent = (g_sys.ref_freq / 9600.0f) * 100.0f;
            }

            len = sprintf(buf, "%u %.1f%%", (uint32_t)g_sys.ref_freq, percent);
#else
            len = sprintf(buf, "%u Hz", (uint32_t)g_sys.ref_freq);
#endif
        }
    }
    else
    {
        len = sprintf(buf, "%s IPS", (g_sys.tapeSpeed == 30) ? "30" : "15");
    }

    width = GrStringWidthGet(&g_context, buf, len);
    x = (SCREEN_WIDTH - 1) - width;
    GrStringDraw(&g_context, buf, -1, x, y, 1);
}


void drawTimeMiddle(void)
{
    char buf[64];
    int32_t x, y;
    int32_t len;
    int32_t width;
    int32_t height;

    /*
     * Draw the big time digits centered
     */

    /* Normal Mono */
    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    if (g_sys.cfgSTC.showLongTime)
    {
        GrContextFontSet(&g_context, g_psFontWDseg7bold18pt);
        height = GrStringHeightGet(&g_context);

        len = sprintf(buf, "%1u:%02u:%02u:",
                 g_sys.tapeTime.hour,
                 g_sys.tapeTime.mins,
                 g_sys.tapeTime.secs);

        width = GrStringWidthGet(&g_context, buf, len);

        x = 12;
        y = (SCREEN_HEIGHT / 2) - ((height / 2) + 5);
        GrStringDraw(&g_context, buf, len, x, y, 0);

        GrContextFontSet(&g_context, g_psFontWDseg7bold10pt);
        len = sprintf(buf, "%02u", g_sys.tapeTime.frame);
        GrStringDraw(&g_context, buf, len, x+width, y+1, 0);

        /* Draw the sign in a different font as 7-seg does not have these chars */
        GrContextFontSet(&g_context, g_psFontCm14); //g_psFontCmss12);
        len = sprintf(buf, "%c", (g_sys.tapeTime.flags & F_PLUS) ? '+' : '-');
        GrStringDrawCentered(&g_context, buf, len, 6, y+6, 1);

        y += height + 4;
        x = 13;
        GrContextFontSet(&g_context, g_psFontFixed6x8);
        GrStringDraw(&g_context, "HR", -1, x, y, 0);
        GrStringDraw(&g_context, "MIN", -1, x + 24, y, 0);
        GrStringDraw(&g_context, "SEC", -1, x + 57, y, 0);
        GrStringDraw(&g_context, "FRM", -1, x + 85, y, 0);
    }
    else
    {
        /*
         * Standard hour, mins, secs time display format
         */

        GrContextFontSet(&g_context, g_psFontWDseg7bold18pt);
        height = GrStringHeightGet(&g_context);

        len = sprintf(buf, "%1u:%02u:%02u:%1u",
                 g_sys.tapeTime.hour,
                 g_sys.tapeTime.mins,
                 g_sys.tapeTime.secs,
                 g_sys.tapeTime.tens);

        x = (SCREEN_WIDTH / 2) - 3;
        y = (SCREEN_HEIGHT / 2) - 5;
        GrStringDrawCentered(&g_context, buf, len, x, y, FALSE);

        /* Draw the sign in a different font as 7-seg does not have these chars */
        GrContextFontSet(&g_context, g_psFontCm14);
        len = sprintf(buf, "%c", (g_sys.tapeTime.flags & F_PLUS) ? '+' : '-');
        GrStringDrawCentered(&g_context, buf, len, 6, y-3, FALSE);

