rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteDisplay.c
        y += height - 5;
        x = 13;
        GrContextFontSet(&g_context, g_psFontFixed6x8);
        GrStringDraw(&g_context, "HR", -1, x, y, 0);
        GrStringDraw(&g_context, "MIN", -1, x + 24, y, 0);
        GrStringDraw(&g_context, "SEC", -1, x + 57, y, 0);
        GrStringDraw(&g_context, "TEN", -1, x + 85, y, 0);
    }
}


void drawTimeBottom(void)
{
    char buf[64];
    int32_t x, y;
    int32_t len;
    int32_t width;
    int32_t height;
    tRectangle rect, rect2;
    TAPETIME tapeTime;

    /*
     *  Bottom line - show current locate memory time
     */

    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);

    x = 0;
    y = SCREEN_HEIGHT - height - 1;

    len = sprintf(buf, "M:%02u", g_sys.cueIndex);
    width = GrStringWidthGet(&g_context, buf, len);

    rect.i16XMin = x;
    rect.i16YMin = y;
    rect.i16XMax = width + 1;
    rect.i16YMax = y + height;

    GrContextForegroundSetTranslated(&g_context, 0);
    GrContextBackgroundSetTranslated(&g_context, 1);

    width = GrStringWidthGet(&g_context, buf, len);
    GrStringDraw(&g_context, buf, -1, x+1, y+1, 1);

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    GrRectDraw(&g_context, &rect);

    /* Get the cue point tape time and display it */

    x = width + 6;
    y = y + 1;

    if (IsCuePointFlags(g_sys.cueIndex, CF_ACTIVE))
    {
        CuePointTimeGet(g_sys.cueIndex, &tapeTime);
        int ch = (tapeTime.flags & F_PLUS) ? '+' : '-';
        snprintf(buf, sizeof(buf)-1, "%c%1u:%02u:%02u:%1u", ch, tapeTime.hour, tapeTime.mins, tapeTime.secs, tapeTime.tens);
        GrStringDraw(&g_context, buf, -1, x, y, 0);
    }
    else
    {
        GrStringDraw(&g_context, " -:--:--:-", -1, x, y, 0);
    }

    /* Display locate progress bar */

    if (!IsLocatorSearching())
    {
        if (g_sys.transportMode & M_RECORD)
        {
            GrContextFontSet(&g_context, g_psFontFixed6x8);
            height = GrStringHeightGet(&g_context);

            len = sprintf(buf, "RECORD");
            width = GrStringWidthGet(&g_context, buf, len);

            x = (SCREEN_WIDTH - 1) - width;
            y = SCREEN_HEIGHT - height - 1;

            rect.i16XMin = x;
            rect.i16YMin = y;
            rect.i16XMax = x + width + 1;
            rect.i16YMax = y + height;

            GrContextForegroundSetTranslated(&g_context, 0);
            GrContextBackgroundSetTranslated(&g_context, 1);

            GrStringDraw(&g_context, buf, -1, x+1, y+1, 1);

            GrContextForegroundSetTranslated(&g_context, 1);
            GrContextBackgroundSetTranslated(&g_context, 0);

            GrRectDraw(&g_context, &rect);
        }
    }
    else
    {
        if (0)
        {
            /* Draw progress as text only */
            GrContextFontSet(&g_context, g_psFontFixed6x8);
            sprintf(buf, "%d%%", g_sys.searchProgress);
            GrStringDraw(&g_context, buf, -1, 100, y, 0);
        }
        else
        {
            /* Draw progress bar */

            x = 35;
            height -= 2;

            rect.i16XMin = SCREEN_WIDTH - x;
            rect.i16YMin = y;
            rect.i16XMax = SCREEN_WIDTH - 1;
            rect.i16YMax = y + height;

            GrContextForegroundSetTranslated(&g_context, 1);
            GrContextBackgroundSetTranslated(&g_context, 0);
            GrRectDraw(&g_context, &rect);

            rect2 = rect;

            rect2.i16XMin += 2;
            rect2.i16YMin += 2;
            rect2.i16XMax -= 2;
            rect2.i16YMax -= 2;

            int32_t x1 = rect2.i16XMin;
            int32_t x2 = rect2.i16XMax;

            float progress = (float)g_sys.searchProgress * 0.01f;

            x = (int16_t)((float)(x2 - x1) * progress) + x1;

            if (x > x2)
                x = x2;

            if (x < x1)
                x = x1;

            rect2.i16XMax = (int16_t)x - 1;

            GrContextForegroundSetTranslated(&g_context, 1);
            GrContextBackgroundSetTranslated(&g_context, 0);

            GrRectFill(&g_context, &rect2);
        }
    }
}


void drawTimeEdit(void)
{
    char buf[64];
    int32_t x, y;
    int32_t len;
    //int32_t width;
    int32_t height;

    /*
     * Draw the big time digits centered
     */

    /* Normal Mono */
    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    /*
     * Standard hour, mins, secs time display format
     */

    //GrContextFontSet(&g_context, g_psFontWDseg7bold18pt);
    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);

    len = sprintf(buf, "ENTER TIME");
    x = (SCREEN_WIDTH / 2) - 3;
    y = (SCREEN_HEIGHT / 2) - 13;
    GrStringDrawCentered(&g_context, buf, len, x, y, FALSE);

    char sign = (g_sys.tapeTime.flags & F_PLUS) ? '+' : '-';

    len = sprintf(buf, "%c %1u:%02u:%02u:%u",
                  sign,
                  g_sys.editTime.hour,
                  g_sys.editTime.mins,
                  g_sys.editTime.secs,
                  g_sys.editTime.tens);

    x = (SCREEN_WIDTH / 2) - 3;
    y = (SCREEN_HEIGHT / 2);
    GrStringDrawCentered(&g_context, buf, len, x-5, y, FALSE);

    y += height + 3;

    len = sprintf(buf, "  H MM SS T");
    GrStringDrawCentered(&g_context, buf, len, x-5, y, FALSE);
}

//*****************************************************************************
// Draw the track assignment screen for the current channel.
//*****************************************************************************

void drawTrackAssign(void)
{
    int32_t x, y;
    int32_t len;
    int32_t trackNum;
    int32_t height;
    tRectangle rect, rect2;
    char buf[64];

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    GrContextFontSet(&g_context, g_psFontFixed6x8);

    if (!g_sys.trackCount || !g_sys.dcsFound)
    {
        x = SCREEN_WIDTH / 2;
        y = SCREEN_HEIGHT / 2;
        GrStringDrawCentered(&g_context, "No DCS-1200", -1, x, y, TRUE);
        GrStringDrawCentered(&g_context, "Track Controller!", -1, x, y+12, TRUE);
        return;
    }

    trackNum = g_sys.remoteTrackNum;

