rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteDisplay.c
    /*** DRAW SAFE/READY MODE AREA ***/

    GrSetRect(&rect, 2, 2, 41, 19);
    GrRectDraw(&g_context, &rect);

    /* Draw inner hi-light rect if active edit field */
    if ((g_sys.remoteFieldIndex == FIELD_TRACK_ARM) && (!g_sys.remoteViewSelect))
    {
        rect2 = rect;
        GrInflateRect(&rect2, 1, 1, -1, -1);
        GrRectDraw(&g_context, &rect2);
    }

    x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2) + 2;
    y = rect.i16YMin + ((rect.i16YMax - rect.i16YMin) / 2) + 1;

    if (g_sys.trackState[trackNum] & STC_T_RECORD)
    {
        GrRectFill(&g_context, &rect);
        strcpy(buf, "REC");
    }
    else
    {
        strcpy(buf, (g_sys.trackState[trackNum] & STC_T_READY) ? "RDY" : "SAFE");
    }

    GrStringDrawCentered(&g_context, buf, -1, x, y, TRUE);

    /*** REPRO/SYNC/INPUT MODE AREA ***/

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    switch(g_sys.trackState[trackNum] & STC_TRACK_MASK)
    {
    case STC_TRACK_REPRO:       /* track is in repro mode */
        strcpy(buf, "REPR");
        break;
    case STC_TRACK_SYNC:        /* track is in sync mode  */
        strcpy(buf, "SYNC");
        break;
    case STC_TRACK_INPUT:       /* track is in input mode */
        strcpy(buf, "INP");
        break;
    default:
        buf[0] = '\0';
        break;
    }

    GrSetRect(&rect, 2, 23, 41, 40);

    if (g_sys.trackState[trackNum] & STC_T_STANDBY)
    {
        GrContextForegroundSetTranslated(&g_context, 1);
        GrContextBackgroundSetTranslated(&g_context, 0);

        GrRectFill(&g_context, &rect);

        GrContextForegroundSetTranslated(&g_context, 0);
        GrContextBackgroundSetTranslated(&g_context, 1);

        strcpy(buf, "INP");
    }
    else
    {
        GrRectDraw(&g_context, &rect);
    }

    /* Draw inner hi-light rect if active edit field */
    if ((g_sys.remoteFieldIndex == FIELD_TRACK_MODE) && (!g_sys.remoteViewSelect))
    {
        rect2 = rect;
        GrInflateRect(&rect2, 1, 1, -1, -1);
        GrRectDraw(&g_context, &rect2);
    }

    x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2) + 2;
    y = rect.i16YMin + ((rect.i16YMax - rect.i16YMin) / 2) + 1;

    GrStringDrawCentered(&g_context, buf, -1, x, y, FALSE);

    /*** DRAW STANDBY MONITOR AREA ***/

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    GrSetRect(&rect, 2, 44, 41, 61);
    GrRectDraw(&g_context, &rect);

    x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2) + 2;
    y = rect.i16YMin + ((rect.i16YMax - rect.i16YMin) / 2) + 1;

    /* Test track standby monitor enable flag */
    if (g_sys.trackState[trackNum] & STC_T_STANDBY)
    {
        GrRectFill(&g_context, &rect);

        GrContextForegroundSetTranslated(&g_context, 0);
        GrContextBackgroundSetTranslated(&g_context, 1);
    }

    /* Draw inner hi-light rect if active edit field */
    if ((g_sys.remoteFieldIndex == FIELD_TRACK_MONITOR) && (!g_sys.remoteViewSelect))
    {
        rect2 = rect;
        GrInflateRect(&rect2, 1, 1, -1, -1);
        GrRectDraw(&g_context, &rect2);

        if (g_sys.trackState[trackNum] & STC_T_STANDBY)
        {
            GrContextForegroundSetTranslated(&g_context, 0);
            GrContextBackgroundSetTranslated(&g_context, 1);
        }
        else
        {
            GrContextForegroundSetTranslated(&g_context, 1);
            GrContextBackgroundSetTranslated(&g_context, 0);
        }
    }

    if (g_sys.trackState[trackNum] & STC_T_MONITOR)
        GrStringDrawCentered(&g_context, "MON", -1, x, y, FALSE);
    else
        GrStringDrawCentered(&g_context, "TAPE", -1, x, y, TRUE);

    /*** DRAW LARGE TRACK NUMBER AREA ***/

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    GrSetRect(&rect, 45, 2, 125, 61);
    GrRectDraw(&g_context, &rect);

    /* Draw inner hi-light rect if active edit field */
    if ((g_sys.remoteFieldIndex == FIELD_TRACK_NUM) && (!g_sys.remoteViewSelect))
    {
        rect2 = rect;
        GrInflateRect(&rect2, 1, 1, -1, -1);
        GrRectDraw(&g_context, &rect2);
    }

    x = 85;
    /* Draw channel number heading label */
    y = 12;
    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);
    len = sprintf(buf, "TRACK");
    GrStringDrawCentered(&g_context, buf, len, x, y, TRUE);
    /* Draw the current edit channel number */
    y = 33;
    GrContextFontSet(&g_context, g_psFontWDseg7bold18pt);
    height = GrStringHeightGet(&g_context);
    len = sprintf(buf, "%u", trackNum + 1);
    GrStringDrawCentered(&g_context, buf, len, x, y, TRUE);
    y += height;

    /*** Draw Tape Time ***/

#if 0
    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);

    int ch = (g_sys.tapeTime.flags & F_PLUS) ? '+' : '-';

    len = snprintf(buf, sizeof(buf)-1, "%c%1u:%02u:%02u:%1u",
             ch,
             g_sys.tapeTime.hour,
             g_sys.tapeTime.mins,
             g_sys.tapeTime.secs,
             g_sys.tapeTime.tens);

    x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2);
    GrStringDrawCentered(&g_context, buf, len, x, y, FALSE);
#endif

    GrContextFontSet(&g_context, g_psFontFixed6x8);
    height = GrStringHeightGet(&g_context);

    if (g_sys.remoteTrackNumSelect)
    {
        GrSetRect(&rect2, rect.i16XMin, rect.i16YMax-12, rect.i16XMax, rect.i16YMax);
        GrRectFill(&g_context, &rect2);

        GrContextForegroundSetTranslated(&g_context, 0);
        GrContextBackgroundSetTranslated(&g_context, 1);

        len = snprintf(buf, sizeof(buf)-1, "JOG+CLICK");
        x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2);
        GrStringDrawCentered(&g_context, buf, len, x, y+3, FALSE);
    }
    else
    {
        len = snprintf(buf, sizeof(buf)-1, (g_sys.standbyMonitor) ? "STANDBY" : "TAPE");
        x = rect.i16XMin + ((rect.i16XMax - rect.i16XMin) / 2);
        GrStringDrawCentered(&g_context, buf, len, x, y, FALSE);
    }
}

//*****************************************************************************
// Helper simple menu options drawing function.
//*****************************************************************************

void MenuDraw(char* heading, MenuOption* menu, size_t count, size_t index)
{
    int32_t i, w;
    int32_t len;
    char buf[32];
    tRectangle rect;
    int32_t maxwidth = 0;

