rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteDisplay.c
    MenuOption* mp = menu;

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    GrSetRect(&rect, 0, 0, SCREEN_WIDTH-1, 10);

    if (g_sys.remoteViewSelect)
    {
        GrRectFill(&g_context, &rect);
        /* Normal Mono */
        GrContextForegroundSetTranslated(&g_context, 0);
        GrContextBackgroundSetTranslated(&g_context, 1);
    }

    GrContextFontSet(&g_context, g_psFontFixed6x8);
    GrStringDrawCentered(&g_context, heading, -1, CENTER_X, 5, TRUE);

    GrContextForegroundSetTranslated(&g_context, 1);
    GrContextBackgroundSetTranslated(&g_context, 0);

    //if (g_sys.remoteViewSelect)
        GrRectDraw(&g_context, &rect);

    for (i=0, mp=menu; i < count; i++, mp++)
    {
        len = sprintf(buf, "%s", mp->text);

        if ((w = GrStringWidthGet(&g_context, buf, len)) > maxwidth)
            maxwidth = w;

        GrStringDrawCentered(&g_context, buf, len, mp->x, mp->y, TRUE);
    }

    /* Show the item hi-light box around current menu item */
    if (g_sys.remoteFieldIndex < count)
    {
        /* Don't show menu item highlight box if view
         * select is currently active.
         */
        //if (!g_sys.remoteViewSelect)
        {
            w = (maxwidth >> 1) + 10;
            mp = menu + index;
            GrSetRect(&rect, mp->x-w, mp->y-5, mp->x+w-1, mp->y+5);
            GrRectDraw(&g_context, &rect);
        }
    }
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuTrackSetAll(void)
{
    static MenuOption menuOptions[] = {
        30, 25, "INPUT",
        30, 35, "SYNC",
        30, 45, "REPRO",
        98, 25, "SAFE",
        98, 35, "READY",
    };

    MenuDraw("SET ALL TRACKS",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuSetStandbyAll(void)
{
    static MenuOption menuOptions[] = {
        CENTER_X, 25, "CLEAR ALL",
        CENTER_X, 35, "SET ALL",
    };

    MenuDraw("STANDBY MONITOR",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuSetMasterMon(void)
{
    static MenuOption menuOptions[] = {
        CENTER_X, 25, "DISABLE",
        CENTER_X, 35, "ENABLE",
    };

    MenuDraw("MASTER MONITOR",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuSetTapeSpeed(void)
{
    static MenuOption menuOptions[] = {
        CENTER_X, 25, "LO-SPEED",
        CENTER_X, 35, "HI-SPEED",
    };

    MenuDraw("TAPE SPEED SELECT",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuSetLongTime(void)
{
    static MenuOption menuOptions[] = {
        CENTER_X, 25, "SHORT",
        CENTER_X, 35, "LONG",
    };

    MenuDraw("TIME DISPLAY FMT",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

//*****************************************************************************
//
//*****************************************************************************

void drawMenuSetBlink7Seg(void)
{
    static MenuOption menuOptions[] = {
        CENTER_X, 25, "NORMAL",
        CENTER_X, 35, "BLINK",
    };

#define MENUSIZ (sizeof(menuOptions)/sizeof(MenuOption))

    MenuDraw("LOCATE BLINK 7-SEG",
             menuOptions,
             sizeof(menuOptions)/sizeof(MenuOption),
             g_sys.remoteFieldIndex);
}

// End-Of-File
